Tekla Open API Reference for Tekla Structures 2025
ModelObjectHatchAttributes Properties
The ModelObjectHatchAttributes type exposes the following members.
Properties
Name | Description
Angle
 The angle in which to draw the hatch.
 (Inherited from HatchAttributes.)
AutomaticScaling
 Specifies whether automatic scaling is enabled. If disabled, custom scale values will be used (see ScaleX and ScaleY).
BackgroundColor
 The background color of the hatch.
 (Inherited from HatchAttributes.)
Color
 The color of the hatch.
 (Inherited from HatchAttributes.)
DrawBackgroundColor
 Sets whether the background color will be enabled or disabled for the hatch. See also: BackgroundColor.
 (Inherited from HatchAttributes.)
FactorType
 The type of the hatch factor.
 (Inherited from HatchAttributes.)
Name
 The name of the hatch. If an empty string is given as hatch name it will become "None".
 (Inherited from HatchAttributes.)
ScaleX
 The scale value of the hatch in the X-direction.
 (Inherited from HatchAttributes.)
ScaleY
 The scale value of the hatch in the Y-direction.
 (Inherited from HatchAttributes.)
TrueBackgroundColor
 The true color (rgb enabled) of the hatch background.
 (Inherited from HatchAttributes.)
TrueColor
 The true color (RGB enabled) of the hatch.
 (Inherited from HatchAttributes.)
Top
See Also
Reference
ModelObjectHatchAttributes Class
Tekla.Structures.Drawing Namespace